## Plans :thumbsup:
<details>
  <summary><h2>Terrateam Plan Output :thumbsup:</h2></summary>


**Dir**: terraform
**Workspace**: default
**Success**: :thumbsup:

```diff

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.asm.kubernetes_namespace.system has been deleted
-   resource "kubernetes_namespace" "system" {
        id = "istio-system"

!       metadata {
-           name             = "istio-system" -> null
            # (5 unchanged attributes hidden)
        }
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
!   update in-place

Terraform will perform the following actions:

  # helm_release.istio-base will be created
+   resource "helm_release" "istio-base" {
+       atomic                     = false
+       chart                      = "base"
+       cleanup_on_fail            = true
+       create_namespace           = false
+       dependency_update          = false
+       disable_crd_hooks          = false
+       disable_openapi_validation = false
+       disable_webhooks           = false
+       force_update               = true
+       id                         = (known after apply)
+       lint                       = false
+       manifest                   = (known after apply)
+       max_history                = 0
+       metadata                   = (known after apply)
+       name                       = "istio-base"
+       namespace                  = "istio-system"
+       pass_credentials           = false
+       recreate_pods              = false
+       render_subchart_notes      = true
+       replace                    = false
+       repository                 = "https://istio-release.storage.googleapis.com/charts"
+       reset_values               = false
+       reuse_values               = false
+       skip_crds                  = false
+       status                     = "deployed"
+       timeout                    = 300
+       verify                     = false
+       version                    = "1.15.0"
+       wait                       = true
+       wait_for_jobs              = false
    }

  # helm_release.istio-egress will be created
+   resource "helm_release" "istio-egress" {
+       atomic                     = false
+       chart                      = "gateway"
+       cleanup_on_fail            = true
+       create_namespace           = false
+       dependency_update          = false
+       disable_crd_hooks          = false
+       disable_openapi_validation = false
+       disable_webhooks           = false
+       force_update               = true
+       id                         = (known after apply)
+       lint                       = false
+       manifest                   = (known after apply)
+       max_history                = 0
+       metadata                   = (known after apply)
+       name                       = "istio-egressgateway"
+       namespace                  = "istio-system"
+       pass_credentials           = false
+       recreate_pods              = false
+       render_subchart_notes      = true
+       replace                    = false
+       repository                 = "https://istio-release.storage.googleapis.com/charts"
+       reset_values               = false
+       reuse_values               = false
+       skip_crds                  = false
+       status                     = "deployed"
+       timeout                    = 300
+       verify                     = false
+       version                    = "1.15.0"
+       wait                       = true
+       wait_for_jobs              = false

+       set {
+           name  = "service.type"
+           value = "ClusterIP"
        }
    }

  # helm_release.istio-ingress will be created
+   resource "helm_release" "istio-ingress" {
+       atomic                     = false
+       chart                      = "gateway"
+       cleanup_on_fail            = true
+       create_namespace           = false
+       dependency_update          = false
+       disable_crd_hooks          = false
+       disable_openapi_validation = false
+       disable_webhooks           = false
+       force_update               = true
+       id                         = (known after apply)
+       lint                       = false
+       manifest                   = (known after apply)
+       max_history                = 0
+       metadata                   = (known after apply)
+       name                       = "istio-ingressgateway"
+       namespace                  = "istio-system"
+       pass_credentials           = false
+       recreate_pods              = false
+       render_subchart_notes      = true
+       replace                    = false
+       repository                 = "https://istio-release.storage.googleapis.com/charts"
+       reset_values               = false
+       reuse_values               = false
+       skip_crds                  = false
+       status                     = "deployed"
+       timeout                    = 300
+       verify                     = false
+       version                    = "1.15.0"
+       wait                       = true
+       wait_for_jobs              = false
    }

  # helm_release.istiod will be created
+   resource "helm_release" "istiod" {
+       atomic                     = false
+       chart                      = "istiod"
+       cleanup_on_fail            = true
+       create_namespace           = false
+       dependency_update          = false
+       disable_crd_hooks          = false
+       disable_openapi_validation = false
+       disable_webhooks           = false
+       force_update               = true
+       id                         = (known after apply)
+       lint                       = false
+       manifest                   = (known after apply)
+       max_history                = 0
+       metadata                   = (known after apply)
+       name                       = "istiod"
+       namespace                  = "istio-system"
+       pass_credentials           = false
+       recreate_pods              = false
+       render_subchart_notes      = true
+       replace                    = false
+       repository                 = "https://istio-release.storage.googleapis.com/charts"
+       reset_values               = false
+       reuse_values               = false
+       skip_crds                  = false
+       status                     = "deployed"
+       timeout                    = 300
+       verify                     = false
+       version                    = "1.15.0"
+       wait                       = true
+       wait_for_jobs              = false

+       set {
+           name  = "grafana.enabled"
+           value = "true"
        }
+       set {
+           name  = "kiali.enabled"
+           value = "true"
        }
+       set {
+           name  = "meshConfig.accessLogFile"
+           value = "/dev/stdout"
        }
+       set {
+           name  = "servicegraph.enabled"
+           value = "true"
        }
+       set {
+           name  = "tracing.enabled"
+           value = "true"
        }
    }

  # kubernetes_annotations.cinema will be updated in-place
!   resource "kubernetes_annotations" "cinema" {
!       annotations = {
+           "mesh.cloud.google.com/proxy" = jsonencode(
                {
+                   managed = "true"
                }
            )
        }
        id          = "apiVersion=v1,kind=Namespace,name=cinema"
        # (2 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # kubernetes_namespace.istio-system will be created
+   resource "kubernetes_namespace" "istio-system" {
+       id = (known after apply)

+       metadata {
+           generation       = (known after apply)
+           name             = "istio-system"
+           resource_version = (known after apply)
+           uid              = (known after apply)
        }
    }

  # module.asm.kubernetes_config_map.asm_options will be created
+   resource "kubernetes_config_map" "asm_options" {
+       data = {
+           "ASM_OPTS"          = "CNI=on"
+           "multicluster_mode" = "manual"
        }
+       id   = (known after apply)

+       metadata {
+           generation       = (known after apply)
+           name             = "asm-options"
+           namespace        = "istio-system"
+           resource_version = (known after apply)
+           uid              = (known after apply)
        }
    }

  # module.asm.kubernetes_namespace.system will be created
+   resource "kubernetes_namespace" "system" {
+       id = (known after apply)

+       metadata {
+           generation       = (known after apply)
+           name             = "istio-system"
+           resource_version = (known after apply)
+           uid              = (known after apply)
        }
    }

Plan: 7 to add, 1 to change, 0 to destroy.

```

<details>
  <summary>To apply this directory and workspace...</summary>

```
terrateam apply dir:terraform workspace:default
```

</details>


</details>

To apply all these changes, comment:

```
terrateam apply
```


---

<details>
  <summary><h3>Feedback?</h3></summary>

Questions? Comments? Give feedback by commenting `terrateam feedback <your msg>`.  Your message lands directly in our inbox.

</details>
